# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige practicum de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [301]:
import pandas as pd
import sqlite3 as sql

Zet het bestand go_sales_train.sqlite in een makkelijk te vinden map

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige practicum de code om een connectie met het bestand go_sales_train.sqlite te maken.

In [302]:
goSalesTrainConn = sql.connect("./SQL/go_sales_train.sqlite")

Lees van de ingelezen go_sales_train-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [303]:
products = pd.read_sql(f"SELECT * FROM product", goSalesTrainConn)
product_types = pd.read_sql(f"SELECT * FROM product_type", goSalesTrainConn)
product_lines = pd.read_sql(f"SELECT * FROM product_line", goSalesTrainConn)
sales_staff = pd.read_sql(f"SELECT * FROM sales_staff", goSalesTrainConn)
sales_branch = pd.read_sql(f"SELECT * FROM sales_branch", goSalesTrainConn)
retailer_site = pd.read_sql(f"SELECT * FROM retailer_site", goSalesTrainConn)
countries = pd.read_sql(f"SELECT * FROM country", goSalesTrainConn)
order_headers = pd.read_sql(f"SELECT * FROM order_header", goSalesTrainConn)
order_details = pd.read_sql(f"SELECT * FROM order_details", goSalesTrainConn)
return_items = pd.read_sql(f"SELECT * FROM returned_item", goSalesTrainConn)
return_reasons = pd.read_sql(f"SELECT * FROM return_reason", goSalesTrainConn)

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt. <u>Let op:</u> lees eventueel de informatie uit het Notebook van werkcollege 1.1b nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [304]:
sql_query = "SELECT name FROM sqlite_master WHERE type='table';"
#Vul dit codeblok verder in
#pd.read_sql(sql_query, ...)
pd.read_sql(sql_query, goSalesTrainConn)
#Op de puntjes hoort de connectie naar go_sales_train óf go_staff_train óf go_crm_train te staan.

             name
0         country
1   order_details
2    order_header
3    order_method
4         product
5    product_line
6    product_type
7   retailer_site
8   return_reason
9   returned_item
10   sales_branch
11    sales_staff

erachter

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [305]:
productionCostsInfo = products[(products["PRODUCTION_COST"] > 50) & (products["PRODUCTION_COST"] < 100)]
productionCostsSpecific = productionCostsInfo[["PRODUCT_NAME", "PRODUCTION_COST"]]

productionCostsSpecific

                        PRODUCT_NAME  PRODUCTION_COST
5          TrailChef Deluxe Cook Set            85.11
7             TrailChef Double Flame            75.00
16                   Hibernator Lite            60.00
17                        Hibernator            86.00
19   Hibernator Self - Inflating Mat            78.55
22               Hibernator Camp Cot            65.33
23      Canyon Mule Climber Backpack            62.50
45           Granite Climbing Helmet            52.86
47             Husky Harness Extreme            55.00
57                    Granite Hammer            57.13
68                         Polar Ice            73.33
69                      Polar Sports            80.00
70                        Polar Wave            60.00
71                     Polar Extreme            72.50
74                      Edge Extreme            80.00
77                         Seeker 35            79.19
78                         Seeker 50            92.58
79                    Seeker Extreme            94.12
82                    Glacier Deluxe            56.25
83                       Glacier GPS            78.55
109                Blue Steel Putter            60.00
110            Blue Steel Max Putter            81.80
113              Course Pro Golf Bag            80.00

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [306]:
prodctionMargeInfo = products[(products["MARGIN"] < 0.2) | (products["MARGIN"] > 0.6)]
productionMargeSpecific = prodctionMargeInfo[["PRODUCT_NAME", "MARGIN"]]
productionMargeSpecific

                    PRODUCT_NAME  MARGIN
20                Hibernator Pad    0.17
23  Canyon Mule Climber Backpack    0.17
85             BugShield Natural    0.67
86               BugShield Spray    0.67
87         BugShield Lotion Lite    0.70
88              BugShield Lotion    0.63
89             BugShield Extreme    0.63

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [307]:
countriesCurrencyInfo = countries[countries["CURRENCY_NAME"] == "francs"]
countriesCurrencySpecific = countriesCurrencyInfo[["COUNTRY"]]

countriesCurrencySpecific

        COUNTRY
0        France
7   Switzerland
15      Belgium

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [308]:
productIntroductionInfo = products[products["MARGIN"] > 0.5].drop_duplicates(subset=["INTRODUCTION_DATE"])
productIntroductionInfo
productIntroductionSpecific = productIntroductionInfo[["INTRODUCTION_DATE"]]

productIntroductionSpecific

    INTRODUCTION_DATE
66         2000-10-26
85         1995-02-15
101        2003-12-10
103        2003-12-18
104        2003-12-27
106        2004-01-13
110        2003-12-15

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [309]:
sales_info = sales_branch[(sales_branch["ADDRESS2"].notna()) & (sales_branch["REGION"].notna())]
sales_info[["ADDRESS1", "CITY"]]

                            ADDRESS1              CITY
2                Singelgravenplein 4         Amsterdam
13  Prol. Paseo de la Reforma No. 51  Distrito Federal
14               202-2-3 Hyakunincho             Tokyo
15                     543-225 Asahi        Osaka City
16                  2315 Queen's Ave         Melbourne
18             Avenida Paulista, 333         São Paulo
24                    3 Albany Court        Birmingham

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [310]:
countriesCurrencyDollar = countries[(countries["CURRENCY_NAME"] == "dollars") | (countries["CURRENCY_NAME"] == "new dollar")]

countriesCurrencyDollar = countriesCurrencyDollar.sort_values(by=["COUNTRY"])

countriesCurrencyDollar

    COUNTRY_CODE        COUNTRY LANGUAGE CURRENCY_NAME
14            16      Australia       EN       dollars
3              4         Canada       EN       dollars
11            12         Taiwan       EN    new dollar
2              3  United States       EN       dollars

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [311]:
retailsGermany = retailer_site[(retailer_site["POSTAL_ZONE"].astype(str).str[0] == "D") & (retailer_site["ADDRESS2"].notna())]
retailsGermany = retailsGermany[["ADDRESS1", "ADDRESS2", "CITY"]]
retailsGermany

            ADDRESS1       ADDRESS2       CITY
31  Röntgenstraße 90  3. Tür rechts  Frankfurt
59   Grubesallee 141       4. Stock    Hamburg

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [312]:
returendQuantity = pd.DataFrame({"RETUREND_QUANTITIES" : return_items[["RETURN_QUANTITY"]].sum()})

returendQuantity

                 RETUREND_QUANTITIES
RETURN_QUANTITY                11908

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [313]:
totalRegions = pd.DataFrame({"Regions" : sales_branch[["REGION"]].drop_duplicates(subset=["REGION"]).count()})

totalRegions

        Regions
REGION       15

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [314]:
lowest : float = products.nsmallest(1, "MARGIN")["MARGIN"].iloc[0]
highest : float = products.nlargest(1, "MARGIN")["MARGIN"].iloc[0]
allMargins : float = products["MARGIN"].sum()
avarage : float = allMargins / products["MARGIN"].count()

margeProductHighestLowest = pd.DataFrame({
    "LOWEST" : [lowest],
    "AVARGE" : [avarage],
    "HIGHEST" : [highest]
})

margeProductHighestLowest

   LOWEST    AVARGE  HIGHEST
0    0.17  0.396609      0.7

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [315]:
housingCustomer = retailer_site["ADDRESS2"].isna().sum()

housingCustomerFrame = pd.DataFrame({"HOUSINGS" : [housingCustomer]})

housingCustomerFrame

   HOUSINGS
0       286

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [316]:
avgCost = order_details.loc[(order_details["UNIT_SALE_PRICE"] < order_details["UNIT_PRICE"]), "UNIT_COST"].mean()

avgCostFrame = pd.DataFrame({"AVG_COST" : [avgCost]})

avgCostFrame

     AVG_COST
0  127.340879

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [317]:
sales_staff.groupby("POSITION_EN", as_index=False)["SALES_STAFF_CODE"].count()

                    POSITION_EN  SALES_STAFF_CODE
0                Branch Manager                19
1              District Manager                 4
2               General Manager                 1
3  Level 1 Sales Representative                13
4  Level 2 Sales Representative                39
5  Level 3 Sales Representative                24
6              Regional Manager                 2

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [318]:
phones = sales_staff.groupby("WORK_PHONE", as_index=False)["SALES_STAFF_CODE"].count()

phones = phones[phones["SALES_STAFF_CODE"] > 4]

phones

             WORK_PHONE  SALES_STAFF_CODE
4     +(44) 121 3505267                 5
10  +(61) 03 2982  4242                 5
11  +31 (0)20 692 93 94                 5
13    +33 1 68 94 52 20                 5
18     1 (206) 292-0012                 5
19     1 (305) 557-4810                 6
20     1 (310) 281-5722                 5
21     1 (403) 232-5986                 5
22     1 (416) 493-5595                 5
23     1 (617) 268-6754                 6

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [319]:
netherlands = pd.merge(retailer_site, countries, left_on="COUNTRY_CODE", how="inner", right_on="COUNTRY_CODE")

netherlands = netherlands[(netherlands["COUNTRY_CODE"] == 7)]

netherlands[["ADDRESS1", "CITY"]]

                      ADDRESS1          CITY
240                   Beets 36         Beets
241               Perestraat 1      Deventer
242  Laan van Meerdervoort 966      Den Haag
243             Kalfjeslaan 47    Amstelveen
244               Startbaan 11    Amstelveen
245      Noorderspoorsingel 28     Groningen
246              Hogehilweg 13     Amsterdam
247             Spoorstraat 43    Varsseveld
248             Westhavenweg 8     Amsterdam
249              Westzeedijk 4        Muiden
250            Gooiergracht 91         Laren
251            Hoofdstraat 150   Pieterburen
252                Olde Diek 2         Laren
253     Amsterdamsestraatweg 8      Maarssen
254        Krayenhoffstraat 11     Amsterdam
255         Overschiestraat 19     Amsterdam
256              Havenbuurt 12        Marken
257               Duivendaal 1    Wageningen
258              Voorstraat 37  Nieuweschans
259         Stadhouderslaan 18     Rotterdam

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [320]:
eyewear = pd.merge(products, product_types, left_on="PRODUCT_TYPE_CODE", how="inner", right_on="PRODUCT_TYPE_CODE")

eyewear = eyewear[eyewear["PRODUCT_TYPE_CODE"] == 11]
eyewear[["PRODUCT_NAME"]]

     PRODUCT_NAME
67      Polar Sun
68      Polar Ice
69   Polar Sports
70     Polar Wave
71  Polar Extreme

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [321]:
staff_order = pd.merge(sales_staff, order_headers, left_on="SALES_STAFF_CODE", how="inner", right_on="SALES_STAFF_CODE")
retailer_staff = pd.merge(retailer_site, staff_order, left_on="RETAILER_SITE_CODE", how="inner", right_on="RETAILER_SITE_CODE")

retailer_staff = retailer_staff[(retailer_staff["POSITION_EN"] == "Branch Manager")]

retailer_staff[["FIRST_NAME", "LAST_NAME", "ADDRESS1"]].drop_duplicates()

     FIRST_NAME LAST_NAME              ADDRESS1
3648     Bayard     Lopes  Alameda Santos, 9876

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

In [322]:
staff_sell = pd.merge(sales_staff, order_headers, left_on="SALES_STAFF_CODE", how="outer", right_on="SALES_STAFF_CODE")
staff_sell = staff_sell[["POSITION_EN", "ORDER_DATE"]]
staff_sell[staff_sell["POSITION_EN"].str.contains("Manager")].drop_duplicates()

           POSITION_EN  ORDER_DATE
0       Branch Manager         NaN
320   Regional Manager         NaN
648   District Manager         NaN
3748    Branch Manager  2024-09-09
3749    Branch Manager  2024-03-13
3750    Branch Manager  2024-01-09
4186   General Manager         NaN

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

In [323]:
product_productType = pd.merge(products, product_types, left_on="PRODUCT_TYPE_CODE", how="inner", right_on="PRODUCT_TYPE_CODE")
product_productType_orders = pd.merge(product_productType, order_details, left_on="PRODUCT_NUMBER", how="inner", right_on="PRODUCT_NUMBER")

product_productType_orders = product_productType_orders[(product_productType_orders["QUANTITY"] > 750)]

product_productType_orders = product_productType_orders[["PRODUCT_NAME", "PRODUCT_TYPE_EN"]]

product_productType_orders.drop_duplicates()

                PRODUCT_NAME    PRODUCT_TYPE_EN
5427                Star Peg              Tents
11452              Firefly 2           Lanterns
28608        BugShield Spray  Insect Repellents
28892  BugShield Lotion Lite  Insect Repellents
29430       BugShield Lotion  Insect Repellents
29442      BugShield Extreme  Insect Repellents
30741         Sun Shelter 15          Sunscreen
31164         Sun Shelter 30          Sunscreen
31775             Sun Shield          Sunscreen

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

In [324]:
product_order = pd.merge(products, order_details, left_on="PRODUCT_NUMBER", how="inner", right_on="PRODUCT_NUMBER")

product_order = product_order[((product_order["UNIT_PRICE"] - product_order["UNIT_SALE_PRICE"]) / product_order["UNIT_PRICE"]) > 0.4]

product_order = product_order[["PRODUCT_NAME"]]

product_order.drop_duplicates()

                       PRODUCT_NAME
27830             BugShield Natural
28283               BugShield Spray
28694         BugShield Lotion Lite
29127              BugShield Lotion
29464             BugShield Extreme
30562                Sun Shelter 15
30929                Sun Shelter 30
34441  Hailstorm Titanium Woods Set

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

In [325]:
returnItem_returnReason = pd.merge(return_items, return_reasons, left_on="RETURN_REASON_CODE", right_on="RETURN_REASON_CODE")
returnItem_returnReason_order = pd.merge(returnItem_returnReason, order_details, left_on="ORDER_DETAIL_CODE", right_on="ORDER_DETAIL_CODE")

returnItem_returnReason_order = returnItem_returnReason_order[((returnItem_returnReason_order["RETURN_QUANTITY"] / returnItem_returnReason_order["QUANTITY"]) > 0.9)]
returnItem_returnReason_order = returnItem_returnReason_order[["RETURN_DESCRIPTION_EN"]]
returnItem_returnReason_order.drop_duplicates()

    RETURN_DESCRIPTION_EN
0  Unsatisfactory product
2   Wrong product shipped
3   Wrong product ordered

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

In [326]:
product_productType_numbers = product_productType.groupby("PRODUCT_TYPE_EN", as_index=False)["PRODUCT_NUMBER"].count().rename(columns={"PRODUCT_NUMBER" : "PRODUCT_COUNT"})

product_productType_numbers

         PRODUCT_TYPE_EN  PRODUCT_COUNT
0             Binoculars              4
1   Climbing Accessories              7
2           Cooking Gear             10
3                Eyewear              5
4              First Aid              5
5       Golf Accessories              4
6      Insect Repellents              5
7                  Irons              4
8                 Knives              5
9               Lanterns             12
10            Navigation              4
11                 Packs              6
12               Putters              3
13                  Rope              4
14                Safety              4
15         Sleeping Bags              7
16             Sunscreen              5
17                 Tents              6
18                 Tools              6
19               Watches              5
20                 Woods              4

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

In [327]:
country_retail = pd.merge(countries, retailer_site, left_on="COUNTRY_CODE", right_on="COUNTRY_CODE")
country_retail = country_retail.groupby("COUNTRY", as_index=False)["RETAILER_CODE"].count()

country_retail

           COUNTRY  RETAILER_CODE
0        Australia             10
1          Austria             10
2          Belgium             10
3           Brazil              1
4           Canada             31
5            China             10
6          Denmark              6
7          Finland              5
8           France             29
9          Germany             32
10           Italy             12
11           Japan             25
12           Korea             10
13          Mexico             10
14     Netherlands             20
15           Spain              9
16          Sweden             12
17     Switzerland             13
18          Taiwan             10
19  United Kingdom             25
20   United States            101

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (4 kolommen, 10 rijen)

In [328]:
product_productType_ordersMerge = pd.merge(product_productType, order_details, left_on="PRODUCT_NUMBER", right_on="PRODUCT_NUMBER")

cooking_gear = product_productType_ordersMerge[["PRODUCT_NAME", "QUANTITY", "UNIT_SALE_PRICE", "PRODUCT_TYPE_EN"]]
cooking_gear = cooking_gear[(cooking_gear["PRODUCT_TYPE_EN"] == "Cooking Gear")]
cooking_gear = cooking_gear.groupby(["PRODUCT_TYPE_EN", "PRODUCT_NAME"], as_index=False).agg({"QUANTITY" : "sum", "UNIT_SALE_PRICE" : 'mean'})
cooking_gear = cooking_gear.rename(columns={"UNIT_SALE_PRICE" : "AVG_PRICE"})

cooking_gear

  PRODUCT_TYPE_EN               PRODUCT_NAME  QUANTITY   AVG_PRICE
0    Cooking Gear          TrailChef Canteen     26544   11.979418
1    Cooking Gear         TrailChef Cook Set     10878   51.687926
2    Cooking Gear              TrailChef Cup     27418    6.976490
3    Cooking Gear  TrailChef Deluxe Cook Set      3110  121.217638
4    Cooking Gear     TrailChef Double Flame     12476  132.672882
5    Cooking Gear           TrailChef Kettle      8826   12.201235
6    Cooking Gear      TrailChef Kitchen Kit     22206   22.345975
7    Cooking Gear     TrailChef Single Flame      8504   63.827622
8    Cooking Gear         TrailChef Utensils     13776   17.294151
9    Cooking Gear        TrailChef Water Bag     36738    6.032506

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 29 rijen)

In [329]:
country_salesBranch = pd.merge(countries, sales_branch, left_on="COUNTRY_CODE", right_on="COUNTRY_CODE")
country_salesBranch_retailer = pd.merge(country_salesBranch, retailer_site, left_on="COUNTRY_CODE", right_on="COUNTRY_CODE")

country_salesBranch_retailer = country_salesBranch_retailer.groupby(["COUNTRY", "CITY_x"], as_index=False)["RETAILER_CODE"].count()
country_salesBranch_retailer = country_salesBranch_retailer.rename(columns={
    "CITY_x" : "SALES_MAN",
    "RETAILER_CODE" : "CUSTOMER"
})
country_salesBranch_retailer

           COUNTRY         SALES_MAN  CUSTOMER
0        Australia         Melbourne        10
1          Austria              Wien        10
2          Belgium          Heverlee        10
3           Brazil         São Paulo         1
4           Canada           Calgary        31
5           Canada           Toronto        31
6            China          Shanghai        10
7          Finland            Kuopio         5
8           France              Lyon        29
9           France             Paris        29
10         Germany           Hamburg        32
11         Germany           München        32
12           Italy            Milano        12
13           Japan        Osaka City        25
14           Japan             Tokyo        25
15           Korea             Seoul        10
16          Mexico  Distrito Federal        10
17     Netherlands         Amsterdam        20
18           Spain            Bilbao         9
19          Sweden             Kista        12
20     Switzerland            Zürich        13
21          Taiwan         San Chung        10
22  United Kingdom        Birmingham        25
23  United Kingdom            London        25
24   United States            Boston       101
25   United States       Los Angeles       101
26   United States             Miami       101
27   United States           Seattle       101

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

In [342]:
staff_no_sales = []

for index, row in sales_staff.iterrows():
    if row["SALES_STAFF_CODE"] not in order_headers["SALES_STAFF_CODE"].values:
        staff_no_sales.append(row)

staff_no_sales = pd.DataFrame(staff_no_sales)

staff_no_sales = staff_no_sales[["FIRST_NAME", "LAST_NAME"]]

staff_no_sales

   FIRST_NAME      LAST_NAME
0       Denis           Pagé
5        Else         Mörike
6       Frank          Fuchs
9       Fritz         Hirsch
10       Jörg          Kunze
12      Maria      Iacobucci
17       Kick        Kalkman
22      Karin      Bergström
25      Sally          White
27      Frank        Bretton
28    Georges  Saint-Germain
33       Alex      Rodriguez
37   Samantha          Floyd
41      Julie          Olsen
45      Corey         Wright
51    Estelle        Johnson
52       Greg        Belding
55      Julie        Béchard
59      Lucía          Reyna
64     Kazumi        Uragome
66      Alice         Walter
84     Walter         Taylor
85   Penelope        Tamrine
88      Polly         Linton
96      Gracy        Gellens

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

In [374]:
less_then_average_margin = []
avarage_margin = products["MARGIN"].mean()

for index, row in products.iterrows():
    if row["MARGIN"] < avarage_margin:
        less_then_average_margin.append(row)

less_then_average_margin = pd.DataFrame(less_then_average_margin)

products_less_then_average_margin_total_average = less_then_average_margin[["MARGIN"]].mean()
products_less_then_average_margin_total = less_then_average_margin[["MARGIN"]].count()

overview_products_less_then_average = [
    int(products_less_then_average_margin_total),
    float(products_less_then_average_margin_total_average)
]

overview_products_less_then_average = pd.DataFrame(overview_products_less_then_average)
overview_products_less_then_average

C:\Users\jdvis_x5odeao\AppData\Local\Temp\ipykernel_24720\2010855549.py:14: FutureWarning: Calling int on a single element Series is deprecated and will raise a TypeError in the future. Use int(ser.iloc[0]) instead
  int(products_less_then_average_margin_total),
C:\Users\jdvis_x5odeao\AppData\Local\Temp\ipykernel_24720\2010855549.py:15: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  float(products_less_then_average_margin_total_average)

           0
0  59.000000
1   0.292203

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

In [436]:
not_returned = pd.merge(products, order_details, left_on="PRODUCT_NUMBER", how="inner", right_on="PRODUCT_NUMBER")
not_returned = pd.merge(not_returned, return_items, left_on="ORDER_DETAIL_CODE", how="inner", right_on="ORDER_DETAIL_CODE")

not_returned = not_returned[not_returned["UNIT_SALE_PRICE"] > 500]
not_returned = not_returned[["PRODUCT_NAME"]].drop_duplicates()
not_returned

                          PRODUCT_NAME
80                           Star Dome
92                        Star Gazer 2
100                       Star Gazer 3
107                       Star Gazer 6
325                     Husky Rope 200
591              Hailstorm Steel Irons
592           Hailstorm Titanium Irons
594         Lady Hailstorm Steel Irons
595      Lady Hailstorm Titanium Irons
596       Hailstorm Titanium Woods Set
600  Lady Hailstorm Titanium Woods Set
602     Lady Hailstorm Steel Woods Set

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

In [443]:
manager = []

for index, row in sales_staff.iterrows():
    if "Manager" in row["POSITION_EN"]:
        row["MANAGER"] = "Ja"
    else:
        row["MANAGER"] = "Nee"
    manager.append(row)

manager = pd.DataFrame(manager)
manager[["LAST_NAME", "MANAGER"]]

     LAST_NAME MANAGER
0         Pagé      Ja
1       Michel     Nee
2     Clermont     Nee
3       Jauvin     Nee
4    Wiesinger     Nee
..         ...     ...
97    Laermans     Nee
98     De Crée     Nee
99     Lattrez     Nee
100  Seefelder     Nee
101     Grüner     Nee

[102 rows x 2 columns]

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [441]:
from datetime import date
date.today().year

2025

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [442]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 25 jaar in dienst) of een ‘lang in dienst’ (groter gelijk dan 12 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)

In [452]:
service = []

date_format = "%Y-%m-%d"
for index, row in sales_staff.iterrows():
    in_service = datetime.strptime(row["DATE_HIRED"], date_format).year
    today = date.today().year
    
    if (today - in_service) >= 12:
        row["12_YEAR"] = "lang in dienst"
    else:
        row["12_YEAR"] = "kort in dienst"
    
    if (in_service - today) < 25:
        row["25_YEAR"] = "kort in dienst"
    else:
        row["25_YEAR"] = "lang in dienst"
    
    service.append(row[["12_YEAR", "25_YEAR"]])

service = pd.DataFrame(service)
service

            12_YEAR         25_YEAR
0    lang in dienst  kort in dienst
1    lang in dienst  kort in dienst
2    lang in dienst  kort in dienst
3    lang in dienst  kort in dienst
4    lang in dienst  kort in dienst
..              ...             ...
97   lang in dienst  kort in dienst
98   lang in dienst  kort in dienst
99   lang in dienst  kort in dienst
100  lang in dienst  kort in dienst
101  lang in dienst  kort in dienst

[102 rows x 2 columns]

## Van Jupyter Notebook naar Pythonproject

1. Richt de map waarin jullie tot nu toe hebben gewerkt in volgens de mappenstructuur uit de slides.
2. Maak van de ontstane mappenstructuur een Pythonproject dat uitvoerbaar is vanuit de terminal. Maak daarin een .py-bestand dat minstens 5 antwoorden uit dit notebook (in de vorm van een DataFrame) exporteert naar Excelbestanden. Alle notebooks mogen als notebook blijven bestaan.
3. Zorg ervoor dat dit Pythonproject zijn eigen repo heeft op Github. Let op: je virtual environment moet <b><u>niet</u></b> meegaan naar Github.

Je mag tijdens dit proces je uit stap 1 ontstane mappenstructuur aanpassen, zolang je bij het beoordelingsmoment kan verantwoorden wat de motivatie hierachter is. De slides verplichten je dus nergens toe.